EmilZander/Bushaltestelle-ESP8266/Firmware/src/main.cpp
#pragma region Variables

#pragma region Globals
LiquidCrystal_I2C lcd(0x27, 16, 2); // The LCD-display
ESP8266WebServer server(80); // The webserver to be hosted
#pragma endregion

static const uint16_t WIFI_MAGIC = 0xA5A5;
static const uint16_t API_MAGIC = 0xB5B5;
static const int EEPROM_SIZE_BYTES = 1024;  // Vergrößert für API-Clients
static const int EEPROM_WIFI_ADDR = 0;
static const int EEPROM_API_ADDR = 256;     // API-Clients Start nach WiFi-Daten

// EEPROM-backed storage for WiFi credentials
struct WifiCreds {
  uint16_t magic;
  char ssid[33];      // 32 chars + null
  char password[65];  // 64 chars + null
};

struct APIclient
{
  int id;
  char name[17];      // 16 chars + null
  char apiKey[17];  // 16 chars + null
  bool enabled;      // 0 = disabled, 1 = enabled
};

const APIclient EMPTY_CLIENT = { -1, "", "", false };

class APIclientList
{
  public:
    static const int MAX_CLIENTS = 8;
    static const int GENERAL_CLIENT_ID = 0; // feste ID
    static constexpr const char* GENERAL_CLIENT_NAME = "Allgemeine Schnittstelle";

  private:
    static APIclient clients[MAX_CLIENTS];
    static int clientCount;

    static void ensureGeneralClient()
    {
      // Prüfen ob der allgemeine Client existiert
      bool found = false;
      for (int i = 0; i < clientCount; i++)
      {
        if (clients[i].id == GENERAL_CLIENT_ID)
        {
          // Name sicherstellen
          strncpy(clients[i].name, GENERAL_CLIENT_NAME, sizeof(clients[i].name) - 1);
          clients[i].name[sizeof(clients[i].name) - 1] = '\0';
          found = true;
          break;
        }
      }

      // Falls nicht vorhanden, neu anlegen
      if (!found)
      {
        APIclient general;
        general.id = GENERAL_CLIENT_ID;
        strncpy(general.name, GENERAL_CLIENT_NAME, sizeof(general.name) - 1);
        general.name[sizeof(general.name) - 1] = '\0';
        strncpy(general.apiKey, generateApiKey().c_str(), sizeof(general.apiKey) - 1);
        general.apiKey[sizeof(general.apiKey) - 1] = '\0';

        // Falls Platz ist, einfügen
        if (clientCount < MAX_CLIENTS)
        {
          clients[clientCount++] = general;
        }
        else
        {
          // Wenn Liste voll ist, ersetzen wir den letzten
          clients[MAX_CLIENTS - 1] = general;
        }
      }
    }
  
  public:
    static const APIclient* clients_get()
    {
      return clients;
    }
  
    static int clientCount_get()
    {
      for (int i = 0; i < MAX_CLIENTS; i++)
      {
        if (clients[i].id == -1)
        {
          clientCount= i;
          break;
        }
      }
    
      return clientCount;
    }    
    
    static APIclient clients_getByID(const int id)
    {
      if (id == -1)
      {
        return EMPTY_CLIENT;
      }

      if (APIclientList::clientCount_get() == 0)
      {
        return EMPTY_CLIENT;
      }

      for (int i = 0; i < APIclientList::clientCount_get(); i++)
      {
        if (APIclientList::clients[i].id == id)
        {
          return APIclientList::clients[i];
        }
      }
      return EMPTY_CLIENT;
    }
    
    static bool clients_add(const APIclient& client)
    {
      if (APIclientList::clientCount >= MAX_CLIENTS)
      {
        return false; // List full
      }
      
      APIclientList::clients[APIclientList::clientCount] = client;
      APIclientList::clientCount++;

      saveToEEPROM();

      return true;
    }
    
    static bool clients_add(const char* name, const char* apiKey)
    {
      APIclient client;
      client.id = APIclientList::getNextID();
      strncpy(client.name, name, sizeof(client.name)-1);
      strncpy(client.apiKey, apiKey, sizeof(client.apiKey)-1);
      return clients_add(client);
    }
    
    static void clients_clear()
    {
      clientCount = 0;
      memset(clients, 0, sizeof(clients));
      ensureGeneralClient();

      saveToEEPROM();
    }
    
    static void clients_removeByID(int id)
    {
      if (id == GENERAL_CLIENT_ID) return; // Ignorieren!

      for (int i = 0; i < clientCount; i++)
      {
        if (clients[i].id == id)
        {
          for (int j = i; j < clientCount - 1; j++)
          {
            clients[j] = clients[j + 1];
          }
          clientCount--;
          break;
        }
      }

      saveToEEPROM();
    }
    
    static int getNextID()
    {
      int i = 1;
      while (i < 100)
      {
        if (clients_getByID(i).id == -1)
        {
          return i;
        }
        i++;
      }
      
      return -1;
    }
    
    static void clients_setByID(int id, const char* name, const char* apiKey)
    {
      for (int i = 0; i < clientCount; i++)
      {
        if (clients[i].id == id)
        {
          if (id != GENERAL_CLIENT_ID)
          {
            strncpy(clients[i].name, name, sizeof(clients[i].name) - 1);
            clients[i].name[sizeof(clients[i].name) - 1] = '\0';
          }
          strncpy(clients[i].apiKey, apiKey, sizeof(clients[i].apiKey) - 1);
          clients[i].apiKey[sizeof(clients[i].apiKey) - 1] = '\0';
          break;
        }
      }
      saveToEEPROM();
    }
    
    static APIclient clients_getByName(char* name)
    {
      for (int i = 0; i < APIclientList::clientCount; i++)
      {
        if (strcmp(APIclientList::clients[i].name, name) == 0)
        {
          return APIclientList::clients[i];
        }
      }
      return EMPTY_CLIENT;
    }

    static String getNextName()
    {
      int i = 1;
      while (true)
      {
        if (APIclientList::clients_getByName((char*)("Client" + String(i)).c_str()).id == -1)
        {
          return ("Client"+String(i)).c_str();
        }
        i++;
      }
    }
    
    // Speichert die API-Clients im EEPROM
    static bool saveToEEPROM() {
      struct APIClientHeader {
        uint16_t magic;
        uint8_t count;
      } header;
      
      header.magic = API_MAGIC;
      header.count = clientCount;
      
      EEPROM.begin(EEPROM_SIZE_BYTES);
      
      // Header schreiben
      EEPROM.put(EEPROM_API_ADDR, header);
      
      // Clients schreiben
      int offset = EEPROM_API_ADDR + sizeof(header);
      for (int i = 0; i < clientCount; i++) {
        EEPROM.put(offset, APIclientList::clients[i]);
        offset += sizeof(APIclient);
      }
      
      bool success = EEPROM.commit();
      EEPROM.end();
      return success;
    }
    
    // Lädt die API-Clients aus dem EEPROM
    static bool fetchFromEEPROM()
    {
      struct APIClientHeader
      {
        uint16_t magic;
        uint8_t count;
      } header;

      EEPROM.begin(EEPROM_SIZE_BYTES);
      EEPROM.get(EEPROM_API_ADDR, header);

