EmilZander/Bushaltestelle-ESP8266/Firmware/src/main.cpp
      if (header.magic != API_MAGIC || header.count > MAX_CLIENTS)
      {
        clients_clear();
        EEPROM.end();
        ensureGeneralClient();
        return false;
      }

      clientCount = header.count;
      int offset = EEPROM_API_ADDR + sizeof(header);
      for (int i = 0; i < clientCount; i++)
      {
        EEPROM.get(offset, clients[i]);
        offset += sizeof(APIclient);
      }

      EEPROM.end();
      ensureGeneralClient(); // <--- hier eingefügt
      return true;
    }
    
    static String generateApiKey() {
      const char charset[] = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789";
      const size_t keyLength = 16;
      String apiKey;
      apiKey.reserve(keyLength);
      
      for (size_t i = 0; i < keyLength; i++) {
        apiKey += charset[random(0, sizeof(charset) - 1)];
      }
      return apiKey;
    }

    static APIclient getNextClient() {
      if (APIclientList::clientCount_get() >= APIclientList::MAX_CLIENTS)
        return EMPTY_CLIENT;
      
      APIclient client = EMPTY_CLIENT;

      client.id = APIclientList::getNextID();
      strncpy(client.apiKey, APIclientList::generateApiKey().c_str(), sizeof(client.apiKey)-1);
      client.apiKey[sizeof(client.apiKey)-1] = '\0'; // Ensure null termination
      strncpy(client.name, APIclientList::getNextName().c_str(), sizeof(client.name)-1);
      client.name[sizeof(client.name)-1] = '\0'; // Ensure null termination
      
      return client;
    }

    static void init()
    {
      fetchFromEEPROM();
    }
};

int APIclientList::clientCount = 0;
APIclient APIclientList::clients[APIclientList::MAX_CLIENTS];

// WiFi login data
String ssid;
String password;

bool stopButtonVal = false; // The value of the stop button

bool apiActivated = false; // If the api requests go through (persisted in EEPROM)

// The text shown by the LCD
String line1Text = "";
String line2Text = "";

// The text shown by the LCD before the temp text was displayed
String line1prevText = "";
String line2prevText = "";

// Until this timestamp the temporary text is displayed
unsigned long displayTempTextUntil = 0;
#pragma endregion

#pragma region Method Declaration
void displayText(String line1, String line2);
void displayTextTemp(const String& line1, const String& line2, const int time);
void handleDisplay();
void clearDisplay(int row);

void handleStopButton();

void fetchPrefs();
void putPrefs();

void handleRoot();
void handleSet();
void handleClear();
void handleAPIget();
void handleAPIset();
void handleAPIclear();
void handlePrefs();
void handlePrefsAPI();
void handlePrefsAPIadd();
void handlePrefsAPIrename();
void handlePrefsApply();
void setupWebServerRoutes();
void showLoadingScreen(int statusCode, const String& message);
#pragma endregion

#pragma region Hilfsfunktionen
//=======AUXILIARY FUNCTIONS========//

// Display text on the LCD
void displayText(String line1 = "", String line2 = "") {
  if (line1 != "")
    line1Text = line1;

  if (line2 != "")
    line2Text = line2;

  lcd.clear();
  lcd.setCursor(0, 0);
  lcd.print(line1Text.c_str());
  lcd.setCursor(0, 1);
  lcd.print(line2Text.c_str());
}

// Display text for a set amount of time on the LCD. After the time has expired the current text is displayed again
void displayTextTemp(const String& line1, const String& line2, const int time) {
  line1prevText = line1Text;
  line2prevText = line2Text;
  displayTempTextUntil = millis() + time;
  displayText(line1, line2);
}

void clearDisplay(int row = -1)
{
  switch (row)
  {
  case -1:
    line1Text = "";
    line2Text = "";
    break;
  case 1:
    line1Text = "";
    break;
  case 2:
    line2Text = "";
    break;
  default:
    line1Text = "";
    line2Text = "";
    break;
  }
  displayText();
}

void fetchPrefs()
{
  EEPROM.begin(EEPROM_SIZE_BYTES);
  WifiCreds creds;
  // Read raw struct from EEPROM
  EEPROM.get(EEPROM_WIFI_ADDR, creds);

  if (creds.magic == WIFI_MAGIC) {
    // Valid data present
    creds.ssid[sizeof(creds.ssid)-1] = '\0';
    creds.password[sizeof(creds.password)-1] = '\0';
    ssid = String(creds.ssid);
    password = String(creds.password);
  } else {
    // No valid data -> use empty strings
    ssid = "";
    password = "";
    // Initialize EEPROM with an empty, valid record to avoid repeated reads
    memset(&creds, 0, sizeof(creds));
    creds.magic = WIFI_MAGIC;
    EEPROM.put(EEPROM_WIFI_ADDR, creds);
    EEPROM.commit();
  }

  EEPROM.end();
}

void putPrefs()
{
  EEPROM.begin(EEPROM_SIZE_BYTES);
  WifiCreds creds;
  memset(&creds, 0, sizeof(creds));
  creds.magic = WIFI_MAGIC;
  // Copy strings with boundary checks
  strncpy(creds.ssid, ssid.c_str(), sizeof(creds.ssid)-1);
  strncpy(creds.password, password.c_str(), sizeof(creds.password)-1);

  EEPROM.put(EEPROM_WIFI_ADDR, creds);
  EEPROM.commit();
  EEPROM.end();
}
#pragma endregion

#pragma region Handlers
//========HANDLERS========//

// Handle the stop button and how he behaves
void handleStopButton() {
    if (digitalRead(STOP_BUTTON) != stopButtonVal) {
        stopButtonVal = digitalRead(STOP_BUTTON);
        if (stopButtonVal == HIGH) {
          digitalWrite(LED, LOW);
          displayTextTemp("WAGEN HAELT", "WAGEN HAELT", 5000);
        }
        else {
          digitalWrite(LED, HIGH);
        }
    }
}

// Handle the display and make sure that the temporary text is refreshed
void handleDisplay() {
  if (displayTempTextUntil != (unsigned long)0 && millis() >= displayTempTextUntil) {
    displayTempTextUntil = 0;
    displayText(line1prevText, line2prevText);
  }
}
#pragma endregion

#pragma region WebServer
//=======WEBSERVER=======//

// The logic for the root path ("/")
void handleRoot() {
  server.send(200, "text/html", html_main);
}

// The logic for the set path ("/set?row1=[...]&row2=[...]")
void handleSet() {
  String row1 = "";
  String row2 = "";

  // Fetch the parameters from the request
  if (server.hasArg("Row1")) row1 = server.arg("Row1");
  if (server.hasArg("Row2")) row2 = server.arg("Row2");

