EmilZander/Bushaltestelle-ESP8266/Firmware/src/main.cpp
  // Refresh the LCD
  displayText(row1.c_str(), row2.c_str());

  server.sendHeader("Location", "/"); // Redirect to root
  showLoadingScreen(303, "Anzeige wird aktualisiert");
}

// The logic for the clear path ("/clear[?row=-1|1|2]")
void handleClear()
{
  int row = -1;
  if (server.hasArg("row")) row = server.arg("row").toInt();
  clearDisplay(row);

  server.sendHeader("Location", "/"); // Redirect to root
  showLoadingScreen(303, "Lösche Anzeige"); 
}

// The logic for the api-get path ("api/get")
void handleAPIget() {
  if (!server.hasArg("id")) return;
  if (!server.hasArg("apiKey")) return;

  APIclient client = APIclientList::clients_getByID(server.arg("id").toInt());

  if (client.id == -1)
  {
    // The json response
    JsonDocument response;
    response["status"] = "failed";
    response["message"] = "invalid client id";
    String jsonString;
    serializeJson(response, jsonString);

    server.send(200, "application/json", jsonString);
    return;
  }

  if ((String)client.apiKey != server.arg("apiKey"))
  {
    // The json response
    JsonDocument response;
    response["status"] = "failed";
    response["message"] = "invalid api key";
    String jsonString;
    serializeJson(response, jsonString);

    server.send(200, "application/json", jsonString);
    return;
  }

  if (!client.enabled)
  {
    // The json response
    JsonDocument response;
    response["status"] = "failed";
    response["message"] = "client disabled";
    String jsonString;
    serializeJson(response, jsonString);

    server.send(200, "application/json", jsonString);
    return;
  }


  JsonDocument response;
  response["row1"] = line1Text;
  response["row2"] = line2Text;
  String jsonString;
  serializeJson(response, jsonString);

  server.send(200, "application/json", jsonString);
}

// The logic for the api-set-request ("/api/set?row1=[...]&row2=[...]")
void handleAPIset()
{
  if (!server.hasArg("id")) return;
  if (!server.hasArg("apiKey")) return;
  
  APIclient client = APIclientList::clients_getByID(server.arg("id").toInt());

  if (client.id == -1)
  {
    // The json response
    StaticJsonDocument<200> response;
    response["status"] = "failed";
    response["message"] = "invalid client id";
    String jsonString;
    serializeJson(response, jsonString);

    server.send(200, "application/json", jsonString);
    return;
  }

  if ((String)client.apiKey != server.arg("apiKey"))
  {
    // The json response
    JsonDocument response;
    response["status"] = "failed";
    response["message"] = "invalid api key";
    String jsonString;
    serializeJson(response, jsonString);

    server.send(200, "application/json", jsonString);
    return;
  }

  if (!client.enabled)
  {
    // The json response
    JsonDocument response;
    response["status"] = "failed";
    response["message"] = "client disabled";
    String jsonString;
    serializeJson(response, jsonString);

    server.send(200, "application/json", jsonString);
    return;
  }

  String row1 = "";
  String row2 = "";

  // Fetch the parameters from the request
  if (server.hasArg("row1")) row1 = server.arg("row1");
  if (server.hasArg("row2")) row2 = server.arg("row2");

  // Refresh the LCD
  displayText(row1.c_str(), row2.c_str());

  // The json response
  JsonDocument response;
  response["status"] = "success";
  response["message"] = "";
  String jsonString;
  serializeJson(response, jsonString);

  server.send(200, "application/json", jsonString);
}

// The logic for the clear path ("/api/clear[?row=-1|1|2]")
void handleAPIclear()
{
  if (!server.hasArg("id")) return;
  if (!server.hasArg("apiKey")) return;

  const APIclient client = APIclientList::clients_getByID(server.arg("id").toInt());

  if (client.id == -1)
  {
    // The json response
    JsonDocument response;
    response["status"] = "failed";
    response["message"] = "invalid client id";
    String jsonString;
    serializeJson(response, jsonString);

    server.send(200, "application/json", jsonString);
    return;
  }

  if ((String)client.apiKey != server.arg("apiKey"))
  {
    // The json response
    JsonDocument response;
    response["status"] = "failed";
    response["message"] = "invalid api key";
    String jsonString;
    serializeJson(response, jsonString);

    server.send(200, "application/json", jsonString);
    return;
  }

  if (!client.enabled)
  {
    // The json response
    JsonDocument response;
    response["status"] = "failed";
    response["message"] = "client disabled";
    String jsonString;
    serializeJson(response, jsonString);

    server.send(200, "application/json", jsonString);
    return;
  }

  int row = -1;
  if (server.hasArg("row")) row = server.arg("row").toInt();
  clearDisplay(row);

  // The json response
  JsonDocument response;
  response["status"] = "success";
  response["message"] = "";
  String jsonString;
  serializeJson(response, jsonString);

  server.send(200, "application/json", jsonString);
}

// The logic for the preferences path ("/preferences")
void handlePrefs() {

  String html = String(html_prefs);

  String apiList;
  for (int i = 0; i < APIclientList::clientCount_get(); i++)
  {
    APIclient client = APIclientList::clients_get()[i];
    Serial.println("ID: "+(String)client.id);

    apiList += String("<div class='api-client-card' data-id='") + client.id + "'>";
    apiList += "<div class='api-client-name'>" + (String) client.name + "</div>";
    apiList += "<div class='api-client-actions'>";
    apiList += "<label class='toggle-switch'><input type='checkbox'";
    if (client.enabled) apiList += " checked";
    apiList += "><span class='slider'></span></label>";
    apiList += "<button class='info-btn'>i</button>";
    apiList += "</div></div>";
  }
  html.replace("%API_LIST%", apiList);

  server.send(200, "text/html", html);
}

void handlePrefsAPI() {
  int id = -1;
  if (server.hasArg("id")) id = server.arg("id").toInt();

  String html = String(html_prefs_api);

  APIclient client = APIclientList::clients_getByID(id);
  Serial.println("ID: "+(String)id+"; Name: "+client.name+"; Key: "+client.apiKey);

  html.replace("%ID%", (String)id);
  html.replace("%Name%", APIclientList::clients_getByID(id).name);
  html.replace("%Key%", APIclientList::clients_getByID(id).apiKey);

  server.send(200, "text/html", html);
}

