EmilZander/Bushaltestelle-ESP8266/Firmware/src/main.cpp
void handlePrefsAPIadd()
{
  APIclient newClient = APIclientList::getNextClient();
  APIclientList::clients_add(newClient);

  server.sendHeader("Location", "/preferences/api?id="+String(newClient.id));
  showLoadingScreen(303, "Füge Client Hinzu"); 
}

void handlePrefsAPIrename() {
  if (server.hasArg("id") && server.hasArg("name") )
  {
    int id = (int) server.arg("id").c_str();
    String name = server.arg("name");

    APIclient client = APIclientList::clients_getByID(id);

    strncpy(client.name, name.c_str(), sizeof(client.name)-1);

    APIclientList::clients_removeByID(id);
    APIclientList::clients_add(client);
  }
}

// The logic for the preferences-apply-path ("preferences/apply?ssid=[...]&pwd=[...]")
void handlePrefsApply() {
  // Fetch data from the request
  if(server.hasArg("ssid")) ssid = server.arg("ssid");
  if(server.hasArg("password")) password = server.arg("password");

  putPrefs();

  showLoadingScreen(200, "Bitte wechsel das WLAN und verbinde dich neu mit dem Gerät");
  delay(2000);
  WiFi.disconnect();
  WiFi.begin(ssid.c_str(), password.c_str());
}

void setupWebServerRoutes() {
  // Webserver Routes
  server.on("/",                        HTTP_GET,   handleRoot);
  server.on("/set",                     HTTP_GET,   handleSet);
  server.on("/clear",                   HTTP_GET,   handleClear);
  
  server.on("/api/get",                 HTTP_GET,   handleAPIget);
  server.on("/api/set",                 HTTP_GET,   handleAPIset);
  server.on("/api/clear",               HTTP_GET,   handleAPIclear);
  server.on("/preferences",             HTTP_POST,  handlePrefs);
  server.on("/preferences",             HTTP_GET,   handlePrefs);

  server.on("/preferences/api",         HTTP_POST,  handlePrefsAPI);
  server.on("/preferences/api",         HTTP_GET,   handlePrefsAPI);
  server.on("/preferences/api/add",     HTTP_POST,  handlePrefsAPIadd);
  server.on("/preferences/api/rename",  HTTP_POST,  handlePrefsAPIrename);
  server.on("/preferences/apply",       HTTP_POST,  handlePrefsApply);
  
  server.begin();
}


// Show the loading screen with a custom message
void showLoadingScreen(int statusCode, const String& message) {
  String html = String(html_loader);
  html.replace("%MESSAGE%", message);
  server.send(statusCode, "text/html", html);
}

#pragma endregion

#pragma region Logic
void setup() {
  Serial.begin(9600);
  pinMode(STOP_BUTTON, INPUT_PULLUP);
  pinMode(LED, OUTPUT);
  
  APIclientList::init();

  lcd.init();
  lcd.backlight();

  lcd.setCursor(0, 0);
  lcd.print("Starte");

  // Fetch the WiFi login-data
  fetchPrefs();

  // Connect to WiFi
  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid.c_str(), password.c_str());
  uint8_t attempts = 0;
  while(WiFi.status() != WL_CONNECTED && attempts < 20) {
    delay(500);
    attempts++;
  }

  if(WiFi.status() == WL_CONNECTED) {
    displayTextTemp("Verbunden", WiFi.localIP().toString().c_str(), 3000);
  } else {
    // Hotspot fallback
    WiFi.mode(WIFI_AP);
    WiFi.softAP("BusStopESP");
    displayTextTemp("Hotspot aktiv:", WiFi.softAPIP().toString().c_str(), 3000);
  }

  setupWebServerRoutes();
}

void loop() {
  handleStopButton();
  handleDisplay();
  server.handleClient();
}
#pragma endregion